AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Ассортимент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>Ассортимент</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РазрешеныЗакупки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешеныПродажи</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектПланирования</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ФорматыМагазинов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДополнительныеСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ДополнительныеСведения</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/КочетовОбменСИнтернетМагазином/Ext/Module.bsl
Процедура ВыгрузитьХМЛ(ТипВыгрузки) Экспорт
	
	Запрос=Новый запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	Номенклатура.ххх_ИдЦентр КАК Ид,
	             |	ЕСТЬNULL(Номенклатура.Родитель.ххх_ИдЦентр, 1) КАК РодительИд,
	             |	Номенклатура.Наименование КАК Наименование
	             |ИЗ
	             |	Справочник.Номенклатура КАК Номенклатура
	             |ГДЕ
	             |	Номенклатура.ЭтоГруппа";
	Папки=Запрос.Выполнить().Выбрать();
	
	Запрос=новый Запрос;
	Запрос.УстановитьПараметр("Розница",Справочники.ххх_Справочник.РозничнаяЦена.значение);
	Запрос.УстановитьПараметр("Формат",Документы.ИзменениеАссортимента.НайтиПоНомеру("06-00000003").ОбъектПланирования);
	Запрос.УстановитьПараметр("ВыгружатьВИнетМагаз",Справочники.ххх_Справочник.ВыгружатьВИнетМагаз.значение);
	Запрос.Текст="ВЫБРАТЬ
	             |	НоменклатураСпр.ххх_ИдЦентр КАК Ид,
	             |	НоменклатураСпр.Родитель.ххх_ИдЦентр КАК родительИд,
	             |	НоменклатураСпр.Весовой КАК Весовой,
	             |	ЕСТЬNULL(НоменклатураСпр.Производитель.Наименование, """") КАК ПроизводительНаименование,
	             |	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	             |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, ""0"") КАК Цена,
	             |	НоменклатураСпр.ххх_НаименованиеИнтернетМагазина КАК Наименование
	             |ПОМЕСТИТЬ ййцу
	             |ИЗ
	             |	Справочник.Номенклатура КАК НоменклатураСпр
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
	             |		ПО (ТоварыНаСкладахОстатки.Номенклатура = НоменклатураСпр.Ссылка)
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &Розница) КАК ЦеныНоменклатурыСрезПоследних
	             |		ПО (ЦеныНоменклатурыСрезПоследних.Номенклатура = НоменклатураСпр.Ссылка)
	             |ГДЕ
	             |	НЕ НоменклатураСпр.ЭтоГруппа
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	НоменклатураСпр.Весовой,
	             |	НоменклатураСпр.Родитель.ххх_ИдЦентр,
	             |	НоменклатураСпр.ххх_ИдЦентр,
	             |	ЕСТЬNULL(НоменклатураСпр.Производитель.Наименование, """"),
	             |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, ""0""),
	             |	НоменклатураСпр.ххх_НаименованиеИнтернетМагазина
	             |
	             |ИНДЕКСИРОВАТЬ ПО
	             |	Ид
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ййцу.Ид КАК Ид,
	             |	ййцу.родительИд КАК родительИд,
	             |	ййцу.Весовой КАК Весовой,
	             |	ййцу.ПроизводительНаименование КАК ПроизводительНаименование,
	             |	ЕСТЬNULL(ййцу.КоличествоОстаток, ""0"") КАК КоличествоОстаток,
	             |	ййцу.Цена КАК Цена,
	             |	ййцу.Наименование КАК Наименование,
	             |	АссортиментСрезПоследних.Номенклатура.ххх_ОписаниеПолное КАК Описание
	             |ПОМЕСТИТЬ йй
	             |ИЗ
	             |	ййцу КАК ййцу
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Ассортимент.СрезПоследних(
	             |				,
	             |				ОбъектПланирования = &формат
	             |					И РазрешеныЗакупки
	             |					И РазрешеныПродажи) КАК АссортиментСрезПоследних
	             |		ПО ййцу.Ид = АссортиментСрезПоследних.Номенклатура.ххх_ИдЦентр
	             |
	             |ОБЪЕДИНИТЬ ВСЕ
	             |
	             |ВЫБРАТЬ
	             |	ййцу.Ид,
	             |	ййцу.родительИд,
	             |	ййцу.Весовой,
	             |	ййцу.ПроизводительНаименование,
	             |	1,
	             |	ййцу.Цена,
	             |	ййцу.Наименование,
	             |	АссортиментСрезПоследних.Номенклатура.ххх_ОписаниеПолное
	             |ИЗ
	             |	ййцу КАК ййцу
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	             |		ПО ййцу.Ид = ДополнительныеСведения.Объект.ххх_ИдЦентр
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Ассортимент.СрезПоследних(
	             |				,
	             |				ОбъектПланирования = &формат
	             |					И РазрешеныЗакупки
	             |					И РазрешеныПродажи) КАК АссортиментСрезПоследних
	             |		ПО ййцу.Ид = АссортиментСрезПоследних.Номенклатура.ххх_ИдЦентр
	             |ГДЕ
	             |	ДополнительныеСведения.Свойство = &ВыгружатьВИнетМагаз
	             |	И ДополнительныеСведения.Значение = ИСТИНА
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	йй.Ид КАК Ид,
	             |	йй.родительИд КАК родительИд,
	             |	йй.Весовой КАК Весовой,
	             |	йй.ПроизводительНаименование КАК ПроизводительНаименование,
	             |	йй.КоличествоОстаток КАК КоличествоОстаток,
	             |	йй.Цена КАК Цена,
	             |	йй.Наименование КАК Наименование,
	             |	йй.Описание КАК Описание
	             |ИЗ
	             |	йй КАК йй";
	Номка=Запрос.Выполнить().Выбрать();
	
	если ТипВыгрузки="Inetshop" Тогда
		Записать_Inetshop(папки,номка)
	ИначеЕсли ТипВыгрузки="Inetshopnoprice" Тогда
		Записать_Inetshopnoprice(папки,номка)
	ИначеЕсли ТипВыгрузки="ostInetshop" Тогда
		Записать_ostInetshop(папки,номка)
	КонецЕсли;
КонецПроцедуры
	

Процедура Записать_Inetshop(папки,номка)
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл("c:\inetshop.xml","windows-1251");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("shop");
	ЗаписьXML.ЗаписатьНачалоЭлемента("name");
	ЗаписьXML.ЗаписатьТекст("Торговая сеть");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("company");
	ЗаписьXML.ЗаписатьТекст("Яблоко");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("url");
	ЗаписьXML.ЗаписатьТекст("http://yabloko.loc");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("currencies");
	ЗаписьXML.ЗаписатьАтрибут("id","RUR");
	ЗаписьXML.ЗаписатьАтрибут("rate","1");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Categories");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("category");
	ЗаписьXML.ЗаписатьАтрибут("id","1");
	ЗаписьXML.ЗаписатьАтрибут("parent","0");
	ЗаписьXML.ЗаписатьТекст("Номенклатура");
	ЗаписьXML.ЗаписатьКонецЭлемента();

	Пока папки.Следующий() Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("category");
		ЗаписьXML.ЗаписатьАтрибут("id",Формат(папки.ид,"ЧРД=.; ЧРГ=''; ЧГ=0"));
		ЗаписьXML.ЗаписатьАтрибут("parent",Формат(папки.РодительИд,"ЧРД=.; ЧРГ=''; ЧГ=0"));
		ЗаписьXML.ЗаписатьТекст(папки.Наименование);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("offers");

	Пока Номка.Следующий() Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("offer");
		ЗаписьXML.ЗаписатьАтрибут("id",Формат(Номка.ид,"ЧРД=.; ЧРГ=''; ЧГ=0"));
		ЗаписьXML.ЗаписатьАтрибут("available",Формат(Номка.КоличествоОстаток,"ЧРД=.; ЧРГ=''; ЧГ=0"));
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("price");
		ЗаписьXML.ЗаписатьТекст(Формат(Номка.Цена,"ЧРД=.; ЧРГ=''; ЧГ=0"));
		ЗаписьXML.ЗаписатьКонецЭлемента();

		ЗаписьXML.ЗаписатьНачалоЭлемента("categoryId");
		ЗаписьXML.ЗаписатьТекст(Формат(Номка.РодительИд,"ЧРД=.; ЧРГ=''; ЧГ=0"));
		ЗаписьXML.ЗаписатьКонецЭлемента();

		ЗаписьXML.ЗаписатьНачалоЭлемента("name");
		ЗаписьXML.ЗаписатьТекст(Номка.наименование);
		ЗаписьXML.ЗаписатьКонецЭлемента();

		ЗаписьXML.ЗаписатьНачалоЭлемента("Vendor");
		ЗаписьXML.ЗаписатьТекст(Номка.ПроизводительНаименование);
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("html2");
		ЗаписьXML.ЗаписатьТекст(Номка.Описание);
		ЗаписьXML.ЗаписатьКонецЭлемента();

		ЗаписьXML.ЗаписатьНачалоЭлемента("weight_flg");
		ЗаписьXML.ЗаписатьТекст(?(Номка.весовой,"true","false"));
		ЗаписьXML.ЗаписатьКонецЭлемента();

		
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;	
	ЗаписьXML.ЗаписатьКонецЭлемента();	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.Закрыть();
	
	HTTPЗапрос = Новый HTTPЗапрос("www.a-yabloko.ru/import/import.php");
	//HTTPЗапрос = Новый HTTPЗапрос("http://d60.s2y.ru/import/import.php");
	HTTPЗапрос.УстановитьИмяФайлаТела("c:\inetshop.xml");	
	Соединение = Новый HTTPСоединение("www.a-yabloko.ru/import/import.php",,,"111:111");
	//Соединение = Новый HTTPСоединение("http://d60.s2y.ru/import/import.php",,,"111:111");
	HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
КонецПРоцедуры

Процедура Записать_Inetshopnoprice(папки,номка)
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл("c:\Inetshopnoprice.xml","windows-1251");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("shop");
	ЗаписьXML.ЗаписатьНачалоЭлемента("name");
	ЗаписьXML.ЗаписатьТекст("Торговая сеть");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("company");
	ЗаписьXML.ЗаписатьТекст("Яблоко");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("url");
	ЗаписьXML.ЗаписатьТекст("http://yabloko.loc");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("currencies");
	ЗаписьXML.ЗаписатьАтрибут("id","RUR");
	ЗаписьXML.ЗаписатьАтрибут("rate","1");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Categories");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("category");
	ЗаписьXML.ЗаписатьАтрибут("id","1");
	ЗаписьXML.ЗаписатьАтрибут("parent","0");
	ЗаписьXML.ЗаписатьТекст("Номенклатура");
	ЗаписьXML.ЗаписатьКонецЭлемента();

	Пока папки.Следующий() Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("category");
		ЗаписьXML.ЗаписатьАтрибут("id",Формат(папки.ид,"ЧРД=.; ЧРГ=''; ЧГ=0"));
		ЗаписьXML.ЗаписатьАтрибут("parent",Формат(папки.РодительИд,"ЧРД=.; ЧРГ=''; ЧГ=0"));
		ЗаписьXML.ЗаписатьТекст(папки.Наименование);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("offers");

	
	Пока Номка.Следующий() Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("offer");
		ЗаписьXML.ЗаписатьАтрибут("id",Формат(Номка.ид,"ЧРД=.; ЧРГ=''; ЧГ=0"));
		ЗаписьXML.ЗаписатьАтрибут("available",Формат(Номка.КоличествоОстаток,"ЧРД=.; ЧРГ=''; ЧГ=0"));
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("categoryId");
		ЗаписьXML.ЗаписатьТекст(Формат(Номка.РодительИд,"ЧРД=.; ЧРГ=''; ЧГ=0"));
		ЗаписьXML.ЗаписатьКонецЭлемента();

		ЗаписьXML.ЗаписатьНачалоЭлемента("name");
		ЗаписьXML.ЗаписатьТекст(Номка.наименование);
		ЗаписьXML.ЗаписатьКонецЭлемента();

		ЗаписьXML.ЗаписатьНачалоЭлемента("Vendor");
		ЗаписьXML.ЗаписатьТекст(Номка.ПроизводительНаименование);
		ЗаписьXML.ЗаписатьКонецЭлемента();

		ЗаписьXML.ЗаписатьНачалоЭлемента("weight_flg");
		ЗаписьXML.ЗаписатьТекст(?(Номка.весовой,"true","false"));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("html2");
		ЗаписьXML.ЗаписатьТекст(Номка.Описание);
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;	
	ЗаписьXML.ЗаписатьКонецЭлемента();		
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.Закрыть();
	
	HTTPЗапрос = Новый HTTPЗапрос("www.a-yabloko.ru/import/import.php");
	HTTPЗапрос.УстановитьИмяФайлаТела("c:\Inetshopnoprice.xml");	
	Соединение = Новый HTTPСоединение("www.a-yabloko.ru/import/import.php",,,"111:111");
	HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);

КонецПРоцедуры

Процедура Записать_ostInetshop(папки,номка)
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл("c:\ostInetshop.xml","windows-1251");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("shop");
	ЗаписьXML.ЗаписатьНачалоЭлемента("name");
	ЗаписьXML.ЗаписатьТекст("Торговая сеть");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("company");
	ЗаписьXML.ЗаписатьТекст("Яблоко");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("url");
	ЗаписьXML.ЗаписатьТекст("http://yabloko.loc");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("offers");	
	Пока Номка.Следующий() Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("offer");
		ЗаписьXML.ЗаписатьАтрибут("id",Формат(Номка.ид,"ЧРД=.; ЧРГ=''; ЧГ=0"));
		ЗаписьXML.ЗаписатьАтрибут("available",Формат(Номка.КоличествоОстаток,"ЧРД=.; ЧРГ=''; ЧГ=0"));
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;	
		
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();

	
	ЗаписьXML.Закрыть();
	
	HTTPЗапрос = Новый HTTPЗапрос("www.a-yabloko.ru/import/import.php");
	HTTPЗапрос.УстановитьИмяФайлаТела("c:\ostInetshop.xml");	
	Соединение = Новый HTTPСоединение("www.a-yabloko.ru/import/import.php",,,"111:111");
	HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);

КонецПРоцедуры
